#######################################################################################################################
# Light. Task 3
# Автоматически сгенерировать отчет о машине в формате doc (как в видео 7.2).
#######################################################################################################################
# In this task I used an example of data related to cars in JSON-format from the site (partially) to make this task
# closer to the reality
# https://github.com/vega/vega/blob/master/docs/data/cars.json
#######################################################################################################################
import datetime

